Revit 2027 API
ExportPatternTable.Item Property
 A copy of the ExportPatternInfo for the pattern's ExportPatternKey.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExportPatternInfo this[
	ExportPatternKey patternKey
] { get; set; }
Public Default Property Item (
	patternKey As ExportPatternKey
) As ExportPatternInfo
	Get
	Set
public:
virtual property ExportPatternInfo^ default[ExportPatternKey^ patternKey] {
	ExportPatternInfo^ get (ExportPatternKey^ patternKey) sealed;
	void set (ExportPatternKey^ patternKey, ExportPatternInfo^ value) sealed;
}
abstract Item : ExportPatternInfo with get, set
override Item : ExportPatternInfo with get, set
Parameters
patternKey ExportPatternKey
Return Value
ExportPatternInfo
 A copy of the ExportPatternInfo.
Exceptions
Exception | Condition
ArgumentException |  When getting this property: An entry with the given key is not present in the table.
Remarks
 When getting this property, it returns a copy of the ExportPatternInfo from the table. In order to make changes to the ExportPatternInfo and use those settings during export, set the modified ExportPatternInfo back into the table using the same key.
See Also
Reference
ExportPatternTable Class
Autodesk.Revit.DB Namespace